import Image from "next/image";

export default function Home() {
  return (
    <div>
      <h1>これはh1の文章です</h1>
      <h2>これはh2の文章です</h2>
      <h3>これはh3の文章です</h3>
      <h4>これはh4の文章です</h4>
      <h5>これはh5の文章です</h5>
      <h6>これはh6の文章です</h6>

      <p>ここはp1です。テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>
      <p>ここはp2です。テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト</p>

      <p><strong>太字による強調</strong>はstrong要素を使用します。</p>
      <p><i>斜体</i>はi要素を使用します。</p>
      <p>上付き文字<sup>※1</sup>はsup要素を使用します。</p>
      <p>下付き文字（CO<sub>2</sub>）はsub要素を使用します。</p>
      
      <ul>
        <li>ulリスト1</li>
        <li>ulリスト2</li>
        <li>ulリスト3</li>
      </ul>
      <ol>
        <li>olリスト1</li>
        <li>olリスト2</li>
        <li>olリスト3</li>
      </ol>

      <pre>
        <code className="language-python">

          def main():
            print("Hello, World!")

          if __name__ == "__main__":
            main()

        </code>
      </pre>
    </div>
  );
}
